---
kind: type
id: T:Autodesk.Revit.DB.MEPAnalyticalConnection
source: html/5564555f-89fd-9348-33f2-f8d1d68cafe5.htm
---
# Autodesk.Revit.DB.MEPAnalyticalConnection

Represents an analytical element that connects mechanical equipment to piping network.

## Syntax (C#)
```csharp
public class MEPAnalyticalConnection : MEPCurve
```

## Remarks
The analytical connection takes mechanical equipment into account of network flow/pressure analysis.
 The connection remains the same even if the mechanical equipment moves and rotates. It enables a
 fast establishment of piping network to analyze the flow and pressure, especially at the early stage
 of the design process.